# Pandas 动手学入门
本课程基于[DataWhale开源教程《Joyful-Pandas》](http://joyfulpandas.datawhale.club/index.html)与[开源项目 ajcr/100-pandas-puzzles](https://github.com/ajcr/100-pandas-puzzles)其[中译版](https://github.com/VXenomac/100-pandas-puzzles-cn)开发. 在数据分析的实践中，Pandas是一个非常重要的库，它集成了非常多的统计分析功能，[《Joyful-Pandas》](http://joyfulpandas.datawhale.club/index.html)是一份非常详尽，并且适合新手的Pandas中文教程，同时它也是Pandas官方认证的中文教程！但笔者学习过程中，始终觉得编程学习“纸上得来终觉浅”，对于刚接触一个新的库的“躬行”笔者认为最好的方式就是对照着官方文档以及QuickStart吧例子自己尝试一遍，并且在实践中学会如何查文档，这是一个开发者必备的技能.因此本教程就是基于这样的思想，给出对应的操作以及对应的文档地址，学习者需要自行查阅文档，完成下面的实践.

## 餐前准备
在这部分中，我们主要学习如何导入Pandas以及查看版本信息，难度是比较简单的.
> 请你阅读Joyful-Pandas第二章，完成下方练习.
http://joyfulpandas.datawhale.club/Content/ch2.html

**1.** 以 `pd` 别名导入 pandas 库

In [2]:
import pandas as pd

**2.** 打印出pandas 库的版本信息

In [3]:
pd.__version__

'1.1.3'

**3.** 打印 pandas 依赖包及其版本信息

In [4]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : db08276bc116c438d3fdee492026f8223584c477
python           : 3.8.5.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.19041
machine          : AMD64
processor        : Intel64 Family 6 Model 142 Stepping 12, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : Chinese (Simplified)_China.936

pandas           : 1.1.3
numpy            : 1.19.2
pytz             : 2020.1
dateutil         : 2.8.1
pip              : 21.3.1
setuptools       : 50.3.1.post20201107
Cython           : 0.29.21
pytest           : 6.1.1
hypothesis       : None
sphinx           : 3.2.1
blosc            : None
feather          : None
xlsxwriter       : 1.3.7
lxml.etree       : 4.6.1
html5lib         : 1.1
pymysql          : 1.0.2
psycopg2         : None
jinja2           : 2.11.2
IPython          : 7.19.0
pandas_datareader: None
bs4              : 4.9.3
bottleneck       : 1.3.2
fsspec           : 0.8.3
fastparquet      : None
gcsfs            : None
matplotlib       : 3.3.2
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 3.0.5
pandas_gbq       : None
pyarrow          : None
pytables         : None
pyxlsb           : None
s3fs             : None
scipy            : 1.5.2
sqlalchemy       : 1.3.20
tables           : 3.6.1
tabulate         : None
xarray           : None
xlrd             : 1.2.0
xlwt             : 1.3.0
numba            : 0.51.2

## 备齐食材
在这部分中，主要介绍了Pandas一个重要的数据结构```DataFrame```

> 请你阅读Joyful-Pandas第二章，完成下方练习.
http://joyfulpandas.datawhale.club/Content/ch2.html

**4.** 使用数据 `data` 和行索引 `labels` 创建一个 DataFrame `df`

In [5]:
import numpy as np

有下面这样的一个数据字典 `data` 以及列表格式的标签数据 `labels`:

In [6]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [7]:
df = pd.DataFrame(data=data,index=labels)

**5.** 显示该 DataFrame 及其数据相关的基本信息（*提示：DataFrame 直接调用的方法*）

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

**6.** 返回 DataFrame `df` 的前4行数据

In [9]:
df.head(4)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes

**7.** 从 DataFrame `df` 选择标签为 `animal` 和 `age` 的列

In [10]:
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**8.** 在 `[3, 4, 8]` 行中，列为 `['animal', 'age']` 的数据

In [11]:
df.iloc[[2,3,7]][['animal','age']]

  animal  age
c  snake  0.5
d    dog  NaN
h    cat  NaN

**9.** 选择列```visits``` 大于 3 的行

In [12]:
df.loc[df['visits']>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

**10.** 选择 `age` 为缺失值的行

In [13]:
df.loc[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

**11.** 选择 `animal` 是cat且`age` 小于 3 的行

In [14]:
df.loc[(df['animal']=='cat')&(df['age']<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

**12.** 选择 `age` 在 2 到 4 之间的数据（包含边界值）

In [15]:
df.loc[(df.age >= 2)&(df.age <= 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

**13.** 将 'f' 行的 `age` 改为 1.5

In [16]:
df.loc['f',['age']] = 1.5

**14.** 对 `visits` 列的数据求和

In [17]:
df.visits.sum()

19

**15.** 计算每种 `animal` `age` 的平均值

In [18]:
animal_kinds = df['animal'].unique()

for i in animal_kinds:
    print("The {}'s mean age is".format(i),df[(df.animal == i)]['age'].mean())

The cat's mean age is 2.3333333333333335
The snake's mean age is 2.5
The dog's mean age is 5.0

**16.** 新增一行数据 k，数据自定义，然后再删除新追加的 k 行

In [19]:
data_k = {'animal':'dog',
        'age':1.8,
        'visits':1,
        'priority':'yes'} 

df.loc['k'] = data_k
df.tail(1)

  animal  age  visits priority
k    dog  1.8       1      yes

**17.** 统计每种 `animal` 的个数

In [20]:
df['animal'].value_counts()

dog      5
cat      4
snake    2
Name: animal, dtype: int64

**18.** 先根据 `age` 降序排列，再根据 `visits` 升序排列（结果 `i` 列在前面，`d` 列在最后面）

In [21]:
df.sort_values(['age','visits'],ascending=[False,True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
k    dog  1.8       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

**19.** 将 `priority` 列的 `yes` 和 `no` 用 `True` 和 `False` 替换

In [22]:
df['priority'].replace(['yes','no'],[True,False],inplace=True)
df

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  1.5       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False
k    dog  1.8       1      True

**20.** 将 `animal` 列的 `snake` 用 `python` 替换

In [23]:
df['animal'].replace('snake','python',inplace=True)
df

   animal  age  visits  priority
a     cat  2.5       1      True
b     cat  3.0       3      True
c  python  0.5       2     False
d     dog  NaN       3      True
e     dog  5.0       2     False
f     cat  1.5       3     False
g  python  4.5       1     False
h     cat  NaN       1      True
i     dog  7.0       2     False
j     dog  3.0       1     False
k     dog  1.8       1      True

**21.** 对于每种 `animal` 和 `visit`，求出平均年龄。换句话说，每一行都是动物，每一列都是访问次数，其值是平均年龄（提示：使用数据透视表）

In [24]:
pd.pivot_table(df,index=['animal','visits'],values=['age'],aggfunc=np.mean)

                age
animal visits
cat    1       2.50
       3       2.25
dog    1       2.40
       2       6.00
python 1       4.50
       2       0.50

**22.** 读取`data`文件夹下的`boston.csv`文件，并尝试利用上面的方法自行分析，得出一些简单的结论.

In [25]:
df_boston = pd.read_csv('data/boston.csv')
df_boston.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     506 non-null    float64
 1   ZN       506 non-null    float64
 2   INDUS    506 non-null    float64
 3   CHAS     506 non-null    int64
 4   NOX      506 non-null    float64
 5   RM       506 non-null    float64
 6   AGE      506 non-null    float64
 7   DIS      506 non-null    float64
 8   RAD      506 non-null    int64
 9   TAX      506 non-null    float64
 10  PTRATIO  506 non-null    float64
 11  B        506 non-null    float64
 12  LSTAT    506 non-null    float64
 13  MEDV     506 non-null    float64
dtypes: float64(12), int64(2)
memory usage: 55.5 KB

至此，相信你已经可以通过阅读文档，掌握了pandas中`DataFrame`的一些基本操作，下面我们来讲点更进一步的操作，它是上述这些操作的一些巧妙结合

## 食材搭配
在这个部分中，我们主要介绍对于DataFrame中的数据的一些操作：去重、数据计算、取值······
> 请你阅读Joyful-Pandas第二章，完成下方练习. http://joyfulpandas.datawhale.club/Content/ch2.html

In [26]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

**23.** 请用pandas操作输出上面的`df`中`A`列出现的元素的唯一值（即：出现过的所有元素的集合）

In [27]:
df['A'].unique()

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

**24.** 输出`df`中的唯一值及其对应出现的频数

In [28]:
df['A'].value_counts()

5    3
7    2
2    2
6    1
4    1
3    1
1    1
Name: A, dtype: int64

**25.** 将`df`进行数据降重

In [29]:
df.drop_duplicates(subset=['A'],keep='first',inplace=True)
df

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

**26.** 给定一组随机数据

In [30]:
df = pd.DataFrame(np.random.random(size=(5, 3))) 
df

          0         1         2
0  0.977174  0.662842  0.451332
1  0.560918  0.376315  0.468972
2  0.917947  0.827819  0.635633
3  0.447325  0.443181  0.005134
4  0.137788  0.979697  0.381810

使每个元素减去所在行的平均值？

In [31]:
df.apply(lambda x:(x-x.mean()),axis=1)

          0         1         2
0  0.280058 -0.034274 -0.245784
1  0.092183 -0.092420  0.000237
2  0.124147  0.034020 -0.158167
3  0.148778  0.144634 -0.293412
4 -0.361977  0.479932 -0.117955

**27.** 返回下列`df`数字总和最小那列的标签

In [32]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.759919,0.521942,0.920606,0.547450,0.035652,0.042474,0.856287,0.158631,0.142180,0.215314
1,0.878786,0.579097,0.803809,0.024767,0.751689,0.013310,0.837664,0.386760,0.068871,0.177424
2,0.948219,0.870976,0.529575,0.876618,0.323331,0.983084,0.109579,0.048288,0.477623,0.274869
3,0.002213,0.880124,0.726248,0.815215,0.407002,0.813064,0.542124,0.614231,0.687896,0.512535
4,0.819319,0.518611,0.847943,0.578365,0.130956,0.404248,0.524869,0.008967,0.103951,0.875526

In [33]:
df.sum().idxmin()

'h'

**28.** 计算一个 DataFrame 有多少不重复的行？

In [34]:
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
df

   0  1  2
0  1  1  0
1  1  1  0
2  1  1  1
3  1  0  1
4  0  1  0
5  0  0  1
6  0  0  1
7  0  1  0
8  0  0  1
9  1  1  1

In [35]:
df.drop_duplicates(keep='first').shape[0]

5

**29.** DataFrame 数据如下，A 和 B 都是 0-100 之间（包括边界值）的数值，对 A 进行分段分组（i.e. (0, 10], (10, 20], ...），求每组内 B 的和。输出应该和下述一致：
```
A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
```

In [36]:
df = pd.DataFrame(np.random.RandomState(8765).randint(1, 101, 
                  size=(100, 2)), 
                  columns = ["A", "B"])
df

     A   B
0   46  29
1   75  22
2   49  63
3   33  43
4   71  75
..  ..  ..
95  60  87
96  57  40
97  86  19
98  50  56
99  97  94

[100 rows x 2 columns]

In [37]:
df['B'].groupby(pd.cut(df['A'],bins=range(0,110,10),right=True)).sum()

A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
Name: B, dtype: int32

## 用pandas进行数据清洗
下面的`df`是我们用到的数据集

In [44]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**30.**  **FlightNumber**列中的某些值缺失（它们是NaN）。这些数字是有规律的，即每行增加 10，因此`NaN`需要放置 10055 和 10075。修改`df`以填充这些缺失的数字并使该列成为整数列（而不是浮点列）

In [54]:
df['FlightNumber'] = np.arange(df['FlightNumber'][0],
                                df['FlightNumber'][0] + len(df)*10.0,
                                10.0
                                )
df['FlightNumber'] = df['FlightNumber'].astype('int')

df

ValueError: Length of values (4) does not match length of index (5)

In [53]:
df['FlightNumber'][len(df)-1]

10085.0

**31.** **From_To**列作为两个单独的列会更好！拆分下划线分隔符`_`前后的每个字符串. 将其拆分成两列，存放在一个名为“temp”的临时 DataFrame，将列名 'From' 和 'To' 分配给这个临时DataFrame.

In [40]:
temp = df['From_To'].str.split('_',expand=True)
temp.columns = ['From','To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**32.** 注意城市名称的大小写是混合在一起的。标准化字符串，以便只有第一个字母是大写的（例如“londON”应该变成“London”。）

In [41]:
df['From_To'] = df['From_To'].apply(lambda x:x.title())
df

            From_To  FlightNumber  RecentDelays              Airline
0      London_Paris         10045      [23, 47]               KLM(!)
1      Madrid_Milan         10055            []    <Air France> (12)
2  London_Stockholm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_Paris         10075          [13]       12. Air France
4   Brussels_London         10085      [67, 32]          "Swiss Air"

**33.** 将`From_To`列从`df`中删去，将`temp`处理好的数据合并到`df`中

In [42]:
df = pd.concat([df.drop(columns=['From_To']),temp],
                axis=1)
                
df['From'] = df['From'].apply(lambda x:x.title())
df['To'] = df['To'].apply(lambda x:x.title())

df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

**34.**在`AirLine`列中，您可以看到航空公司名称周围出现了一些额外的符号。只提取航空公司名称。例如'(British Airways. )'应该变成'British Airways'.

In [43]:
from string import punctuation
df['Airline'] = df['Airline'].str.translate(str.maketrans(',',punctuation + '0123456789'))

df

ValueError: the first two maketrans arguments must have equal length

**35.** 在 RecentDelays 列中，值已作为列表输入到 DataFrame 中。我们希望每个第一个值在它自己的列中，每个第二个值在它自己的列中，依此类推。如果没有第 N 个值，则该值应为 NaN。

将 Series 列表展开为名为 的 DataFrame delays，重命名列delay_1，delay_2等等，并将不需要的 RecentDelays 列替换df为delays

In [ ]:
delays = df['RecentDelays'].apply(pd.Series)

delay_columns = [f'delay_{i}'for i in range(delays.shape[1])]

delays.columns = delay_columns

df = pd.concat([df.drop(columns=['RecentDelays']),delays],axis=1)

df

,FlightNumber,Airline,From,To,delay_0,delay_1,delay_2
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN